export const genders = ["여성", "남성"] as const;
export const ages = ["20~22세 느낌", "23~25세 느낌", "26~29세 느낌"] as const;
export const styleBases = [
  "한국인",
  "일본인",
  "중국인",
  "동남아시아 계열",
  "뚜렷한 혼혈 ",
] as const;

export const femaleVibes = [
  "청순한",
  "사랑스러운",
  "고급스러운",
  "시크한",
  "부드러운",
  "신비로운",
  "아이돌 같은",
  "모델 같은",
  "배우 같은",
  "추천으로 할게요",
] as const;

export const maleVibes = [
  "훈훈한",
  "시크한",
  "댄디한",
  "남성적인",
  "소년미 있는",
  "배우 같은",
  "아이돌 같은",
  "모델 같은",
  "추천으로 할게요",
] as const;

export const faceShapes = [
  "계란형 얼굴형",
  "브이라인형",
  "부드러운 윤곽",
  "또렷한 윤곽",
  "입체감 있는 얼굴형",
  "균형 잡힌 얼굴형",
  "또렷한 턱선",
  "슬림한 얼굴형",
  "추천으로 할게요",
] as const;

export const eyebrows = [
  "자연스러운 아치형 눈썹",
  "정돈된 일자형 눈썹",
  "짙고 또렷한 눈썹",
  "부드러운 인상의 눈썹",
  "얇고 정리된 눈썹",
  "깔끔하게 정돈된 눈썹",
  "추천으로 할게요",
] as const;

export const femaleEyes = [
  "부드러운 눈매",
  "또렷한 눈매",
  "순한 눈매",
  "고양이상 눈매",
  "강아지상 눈매",
  "큰 눈",
  "길게 뻗은 눈매",
  "자연스러운 쌍꺼풀",
  "깊이감 있는 눈매",
  "추천으로 할게요",
] as const;

export const maleEyes = [
  "부드러운 눈매",
  "날카로운 눈매",
  "차가운 눈매",
  "또렷한 눈매",
  "깊이감 있는 눈매",
  "순한 눈매",
  "긴 눈매",
  "살짝 올라간 눈매",
  "무쌍 ",
  "자연스러운 쌍꺼풀",
  "추천으로 할게요",
] as const;

export const noses = [
  "작고 정돈된 코",
  "자연스러운 코",
  "콧대가 있는 코",
  "반듯한 코",
  "직선형 코",
  "부드러운 곡선형 코",
  "입체감 있는 코",
  "남성적인 코 라인",
  "세련된 코 라인",
  "추천으로 할게요",
] as const;

export const lips = [
  "자연스러운 입매",
  "생기 있는 입매",
  "도톰한 입술",
  "얇고 세련된 입술",
  "단정한 입매",
  "입꼬리가 살짝 올라간 입매",
  "웃을 때 예쁜 입매",
  "추천으로 할게요",
] as const;

export const skins = [
  "깨끗한 피부결",
  "자연스러운 광채 피부",
  "보송한 피부 표현",
  "매끈한 피부",
  "화보 같은 피부 질감",
  "AI 티가 덜 나는 자연스러운 피부",
  "추천으로 할게요",
] as const;

export const femaleHairs = [
  "긴 생머리",
  "자연스러운 웨이브",
  "앞머리 있는 스타일",
  "앞머리 없는 스타일",
  "얼굴선을 살려주는 머리",
  "귀를 드러낸 스타일",
  "묶은 머리",
  "단정한 스타일",
  "추천으로 할게요",
] as const;

export const maleHairs = [
  "단정한 가르마",
  "내린 머리",
  "자연스러운 볼륨감",
  "깔끔한 스타일",
  "아이돌 스타일 헤어",
  "배우  헤어",
  "이마가 드러나는 스타일",
  "살짝 흐트러진 스타일",
  "추천으로 할게요",
] as const;

export const femaleMakeups = [
  "민낯에 가까운 느낌",
  "내추럴 메이크업",
  "아이돌 메이크업",
  "화보 메이크업",
  "글로시 메이크업",
  "매트 메이크업",
  "고급스러운 음영 메이크업",
  "추천으로 할게요",
] as const;

export const maleMakeups = [
  "메이크업 없음에 가까운 느낌",
  "자연스러운 피부 보정 느낌",
  "정돈된 화보 메이크업 느낌",
  "추천으로 할게요",
] as const;

export const finalMoods = [
  "자연스러운 얼굴 중심",
  "아이돌 프로필 느낌",
  "배우 프로필 느낌",
  "뷰티 화보 느낌",
  "럭셔리 광고 느낌",
  "상업 광고 모델 느낌",
  "정면 클로즈업 중심",
  "추천으로 할게요",
] as const;